src/Documents/КорректировкаРеализации/КорректировкаРеализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="69ec59c6-f56d-4522-9097-9fe67516b81d">
  <name>КорректировкаРеализации</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="f9dfde40-a80d-4f70-bce8-48c12273ffa3">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d1144913-eaa2-41c1-b810-7464960f9342">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b2446bab-37cc-4041-8467-91555f3537e6">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e1735101-1ad2-4eba-bbb9-cddb30fc5097">
    <name>КлиентПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18c7605e-4ee3-4f55-b0af-9844334f5848">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b2dfb19e-217f-4724-b5ec-8df359aaf364">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e96e43f8-a80c-46e5-bbcf-d05e9b1971fe">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1436d0e0-c4b2-4b28-af09-811ec7c7aacf">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fced204c-0c54-4fa5-a8cb-b2cdc5ded002">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="feb03a43-ab60-40c6-9004-ab9f56ba22ee">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7efb9466-f2f7-42ed-9816-5f275a14c224">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ax_УС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ax_ПроверенСкладом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ax_МаксимальныйКодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="94291334-e86a-4d8f-8a7f-25102f19ed37">
    <name>Расхождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="5debbd40-d502-4cc8-9f59-fe9e56b6b742">
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b2a17232-90f9-41f2-9c1e-0c9943cbdbb0">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f4c17929-a528-47ae-8c48-cb1f7e925fbb">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="aa41e10f-995d-4d40-9d48-57d9d5a8a572">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="be988425-6a9a-498f-9087-c2656fb474f8">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dd86e179-b34f-4a01-ab6e-f8ff28eccf0f">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="96f22d6f-b2d9-41b9-a8fb-81b48d2716d8">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2330b38d-896a-482f-8a4f-c3aa6e910770">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4690f106-ddf8-42bc-966a-52542cdd8193">
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ax_КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="47d4c4b1-ad20-4a33-9f35-595aaaf46324">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="636d0a9c-2c30-4ec5-8bd4-4d8c94f4c603">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1b2597da-485c-4a1f-9433-68667d73f23e">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="fd688817-b095-4ed2-ae74-b445d5c7b267">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cf3bbef9-9cb4-4263-8adf-4f7717b91f7a">
      <name>НоменклатураПартнера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dd2b7d27-d12b-44dc-910b-d12f6f4110a7">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ecadefe7-6500-4408-9d60-7b4bdf924a4c">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0fefcead-eb61-4d3e-a18d-75870606ea9b">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="65b2ef19-fe9a-4c93-a8d7-7f2e9f18504a">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="547b131f-334d-4995-8699-124a05e39661">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fb1a9061-87b0-4c6c-ae60-c7ca7aadb7e9">
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="287f9a0c-5000-4153-bae9-18e7da29d245">
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e6d26966-3419-4ec5-a831-9e7546a6baa4">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/КорректировкаРеализации/ObjectModule.bsl
&После("ПередЗаписью")
Процедура ax_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	СсылкаРасхождения = Ссылка.Расхождения.Выгрузить();
	
	Для Каждого СтрокаРасхождения Из Расхождения Цикл 				
		 СтрокаСсылкаРасхождения = СсылкаРасхождения.Найти(СтрокаРасхождения.Номенклатура, "Номенклатура");
		Если СтрокаСсылкаРасхождения <> Неопределено Тогда 
			ЗаполнитьЗначенияСвойств(СтрокаРасхождения, СтрокаСсылкаРасхождения, "ax_КодСтроки");	
		КонецЕсли;
	КонецЦикла;
		
	ОбменДаннымиWMS4.УстановитьКлючВСтрокахТабличнойЧасти(ЭтотОбъект, "Расхождения");
	
КонецПроцедуры
